---
title: Sweep
classe: Autodesk.Revit.DB.Sweep
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.GenericForm
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# Sweep

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsTrajectorySegmentationEnabled { get; set; }` | `sweep.IsTrajectorySegmentationEnabled` | Boolean |
| `Double MaxSegmentAngle { get; set; }` | `sweep.MaxSegmentAngle` | Double |
| `Path3d Path3d { get; }` | `sweep.Path3d` | Path3d |
| `Sketch PathSketch { get; }` | `sweep.PathSketch` | Sketch |
| `Sketch ProfileSketch { get; }` | `sweep.ProfileSketch` | Sketch |
| `FamilySymbolProfile ProfileSymbol { get; }` | `sweep.ProfileSymbol` | FamilySymbolProfile |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```